<a href="https://colab.research.google.com/github/qiuyu-Liu/290Blueman/blob/main/DataX_Team16.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
heloo

In [2]:
import pandas as pd

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.activity.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fphotos.native&response_type=code

Enter your authorization code:

ValueError: ignored

In [7]:
file = pd.read_csv("query_result_houses.csv")

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (8,9,10,17,18,19,29,30,31,32,42,43,45,49,53,54) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [9]:
file.describe()

        is_deleted  rent_duration  ...  Unnamed: 62  Unnamed: 63
count  9116.000000     508.000000  ...          0.0          1.0
mean      0.168605       5.807087  ...          NaN          0.0
std       0.386817       4.115467  ...          NaN          NaN
min       0.000000       0.000000  ...          NaN          0.0
25%       0.000000       2.000000  ...          NaN          0.0
50%       0.000000       6.000000  ...          NaN          0.0
75%       0.000000       9.000000  ...          NaN          0.0
max       2.000000      12.000000  ...          NaN          0.0

[8 rows x 15 columns]

In [13]:
file.isna().sum().T.to_frame()

                    0
id                 11
user_id            39
country_id       4091
city_id           451
city_name_input   224
...               ...
Unnamed: 59      9189
Unnamed: 60      9189
Unnamed: 61      9189
Unnamed: 62      9189
Unnamed: 63      9188

[64 rows x 1 columns]